Tekla Open API Reference for Tekla Structures 2025
String Implicit Conversion (String to String)
 Converts from string to Datatype.String.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static implicit operator String (
	string From
)
Public Shared Widening Operator CType (
	From As String
) As String
Parameters
From
Type: System.String
The value to be converted.
Return Value
Type: String
The converted Datatype.String value.
See Also
Reference
String Structure
Implicit Overload
Tekla.Structures.Datatype Namespace